app/views/emp/edit.html.erb

        <% @qualification.each do |p|%>
         <%= check_box_tag 'people_ids[]', p.id, @emp.qualifications.include?(p) %>
---
SELECT 1 FROM `qualifications` INNER JOIN `emps_qualifications` ON `qualifications`.`id` = `emps_qualifications`.`qualification_id` WHERE `emps_qualifications`.`emp_id` = 19 AND `qualifications`.`id` = 11 LIMIT 1