app/views/emp/index.html.erb


<% unless @emps.empty? %>
---
SELECT `emps`.* FROM `emps`