app/controllers/emp_controller.rb

  def delete
    @employee= Emp.find(params[:id])

    @employee.destroy
---
SELECT `emps`.* FROM `emps` WHERE `emps`.`id` = 43 LIMIT 1
DELETE FROM `emps` WHERE `emps`.`id` = 43

  def edit
    @qualification=Qualification.find(:all)
    if request.get?
      session['employer_id']=params[:id];
      @emp = Emp.find(:first, :conditions=>["id=#{params[:id]}"])
    end
    if request.post?

      @emp = Emp.find(:first, :conditions=>["id=#{session['employer_id']}"])

      @emp.qualifications.destroy_all
      params[:people_ids] ||= []
      @emp.qualifications << Qualification.find(params[:people_ids])
      unless @emp.blank?
        if @emp.update_attributes(params[:emp])
---
SELECT `qualifications`.* FROM `qualifications` WHERE `qualifications`.`id` IN (11, 12, 13, 14, 15, 16)
SELECT `emps`.* FROM `emps` WHERE `emps`.`id` IS NULL LIMIT 1
DELETE FROM `emps_qualifications` WHERE `emps_qualifications`.`emp_id` = 19 AND `emps_qualifications`.`qualification_id` IN (11, 11, 11, 12, 12, 12, 13, 13, 14)
INSERT INTO `emps_qualifications` (`emp_id`, `qualification_id`) VALUES (23, 11)
SELECT 1 FROM `qualifications` INNER JOIN `emps_qualifications` ON `qualifications`.`id` = `emps_qualifications`.`qualification_id` WHERE `emps_qualifications`.`emp_id` = 19 AND `qualifications`.`id` = 11 LIMIT 1
SELECT `qualifications`.* FROM `qualifications`
UPDATE `emps` SET `name` = 'bull', `address` = 'shit', `updated_at` = '2012-03-22 13:12:32' WHERE `emps`.`id` = 46

  def new
    @header="Please add Emp"
    @qualification=Qualification.find(:all)

    if request.post?
      @emp_form=Emp.new(params[:emp])
      params[:people_ids] ||= []
      @emp_form.qualifications << Qualification.find(params[:people_ids])
---
SELECT `qualifications`.* FROM `qualifications` WHERE `qualifications`.`id` = 11 LIMIT 1
INSERT INTO `emps_qualifications` (`emp_id`, `qualification_id`) VALUES (10, 5)
INSERT INTO `emps` (`address`, `age`, `created_at`, `name`, `updated_at`) VALUES ('', NULL, '2012-03-22 07:35:57', '', '2012-03-22 07:35:57')
INSERT INTO `qualifications` (`created_at`, `name`, `updated_at`) VALUES ('2012-03-26 08:52:17', NULL, '2012-03-26 08:52:17')