app/controllers/qualification_controller.rb

INSERT INTO `qualifications` (`created_at`, `name`, `updated_at`) VALUES ('2012-03-23 06:19:38', '', '2012-03-23 06:19:38')
---
  def new
      if request.post?
      @qualification=Qualification.new(params[:qualification])
      if @qualification.save